{"results":[{"id":1,"type":"standard","challenge_id":1,"content":"You need to work with the server-side API directly. Try different HTTP verbs on different entities exposed through the API.","cost":45},{"id":2,"type":"standard","challenge_id":2,"content":"Who would want a server access log to be accessible through a web application?","cost":70},{"id":3,"type":"standard","challenge_id":3,"content":"You have to assign the unassignable.","cost":45},{"id":4,"type":"standard","challenge_id":4,"content":"It is just slightly harder to find than the score board link.","cost":25},{"id":5,"type":"standard","challenge_id":5,"content":"Look out for a tweet praising new functionality of the web shop. Then find a third party vulnerability associated with it.","cost":135},{"id":6,"type":"standard","challenge_id":6,"content":"He might have spoilered it on at least one occasion where a camera was running. Maybe elsewhere as well.","cost":45},{"id":7,"type":"standard","challenge_id":7,"content":"The developers truly believe in \"Security through Obscurity\" over actual access restrictions.","cost":100},{"id":8,"type":"standard","challenge_id":8,"content":"The feature you need to exploit for this challenge is not directly advertised anywhere.","cost":100},{"id":9,"type":"standard","challenge_id":9,"content":"After finding a CAPTCHA bypass, write a script that automates feedback submission. Or open many browser tabs and be really quick.","cost":45},{"id":10,"type":"standard","challenge_id":10,"content":"In previous releases this challenge was wrongly accused of being based on CSRF.","cost":100},{"id":11,"type":"standard","challenge_id":11,"content":"Find out how the application handles unavailable products and try to find a loophole.","cost":70},{"id":12,"type":"standard","challenge_id":12,"content":"What is even \"better\" than a legacy page with a homegrown RegEx sanitizer? Having CSP injection issues on the exact same page as well!","cost":70},{"id":13,"type":"standard","challenge_id":13,"content":"Only some input fields validate their input. Even less of these are persisted in a way where their content is shown on another screen.","cost":45},{"id":14,"type":"standard","challenge_id":14,"content":"Analyze and tamper with links in the application that deliver a file directly.","cost":10},{"id":15,"type":"standard","challenge_id":15,"content":"Look for an input field where its content appears in the HTML when its form is submitted.","cost":10},{"id":16,"type":"standard","challenge_id":16,"content":"Find out where this information could come from. Then craft a UNION SELECT attack string against an endpoint that offers an unnecessary way to filter data.","cost":45},{"id":17,"type":"standard","challenge_id":17,"content":"The developers who disabled the interface think they could go invisible by just closing their eyes.","cost":25},{"id":18,"type":"standard","challenge_id":18,"content":"If you solved one of the three file access challenges, you already know where to find the easter egg.","cost":70},{"id":19,"type":"standard","challenge_id":19,"content":"Try to find and attack an endpoint that responds with user information. SQL Injection is not the solution here.","cost":100},{"id":20,"type":"standard","challenge_id":20,"content":"Try to create the needed user \"out of thin air\".","cost":70},{"id":21,"type":"standard","challenge_id":21,"content":"Try to submit bad input to forms. Alternatively tamper with URL paths or parameters.","cost":10},{"id":22,"type":"standard","challenge_id":22,"content":"Try to identify past special event or holiday campaigns of the shop first.","cost":70},{"id":23,"type":"standard","challenge_id":23,"content":"Brute force is not the only option for this challenge, but a perfectly viable one.","cost":100},{"id":24,"type":"standard","challenge_id":24,"content":"Once you found admin section of the application, this challenge is almost trivial.","cost":25},{"id":25,"type":"standard","challenge_id":25,"content":"Try either a) a knowledgable brute force attack or b) reverse engineering or c) some research in the cloud.","cost":135},{"id":26,"type":"standard","challenge_id":26,"content":"You can solve this by tampering with the user interface or by intercepting the communication with the RESTful backend.","cost":45},{"id":27,"type":"standard","challenge_id":27,"content":"Observe the flow of product review posting and editing and see if you can exploit it.","cost":45},{"id":28,"type":"standard","challenge_id":28,"content":"This challenge is explicitly not about acquiring the RSA private key used for JWT signing.","cost":135},{"id":29,"type":"standard","challenge_id":29,"content":"You need to trick a security mechanism into thinking that the file you want has a valid file type.","cost":70},{"id":30,"type":"standard","challenge_id":30,"content":"You need to trick a security mechanism into thinking that the file you want has a valid file type.","cost":70},{"id":31,"type":"standard","challenge_id":31,"content":"This challenge has nothing to do with mistyping web domains. There is no conveniently misplaced file helping you with this one either. Or is there?","cost":100},{"id":32,"type":"standard","challenge_id":32,"content":"Turns out that something is technically and legally wrong with the implementation of the \"right to be forgotten\" for users.","cost":45},{"id":33,"type":"standard","challenge_id":33,"content":"Trick the regular Data Export to give you more than actually belongs to you.","cost":70},{"id":34,"type":"standard","challenge_id":34,"content":"Finding a piece of displayed information that could originate from an HTTP header is part of this challenge.","cost":70},{"id":35,"type":"standard","challenge_id":35,"content":"You need to trick the hacking progress persistence feature into thinking you solved challenge #999.","cost":135},{"id":36,"type":"standard","challenge_id":36,"content":"Once you have it, a technique called \"Password Spraying\" might prove useful.","cost":100},{"id":37,"type":"standard","challenge_id":37,"content":"Your own SQLi and someone else's Ctrl-V will be your accomplices in this challenge!","cost":70},{"id":38,"type":"standard","challenge_id":38,"content":"This challenge has nothing to do with mistyping web domains. Investigate the forgotten developer's backup file instead.","cost":70},{"id":39,"type":"standard","challenge_id":39,"content":"Try different SQL Injection attack patterns depending whether you know the admin's email address or not.","cost":25},{"id":40,"type":"standard","challenge_id":40,"content":"This challenge will make you go after a needle in a haystack.","cost":45},{"id":41,"type":"standard","challenge_id":41,"content":"If you know Bender's email address, try SQL Injection. Bender's password hash might not help you very much.","cost":45},{"id":42,"type":"standard","challenge_id":42,"content":"The security flaw behind this challenge is 100% OWASP Juice Shop's fault and 0% Google's.","cost":70},{"id":43,"type":"standard","challenge_id":43,"content":"Try cracking Jim's password hash if you harvested it already. Alternatively, if you know Jim's email address, try SQL Injection.","cost":45},{"id":44,"type":"standard","challenge_id":44,"content":"You should listen to MC's hit song \"Protect Ya Passwordz\".","cost":25},{"id":45,"type":"standard","challenge_id":45,"content":"The underlying flaw of this challenge is a lot more human error than technical weakness.","cost":135},{"id":46,"type":"standard","challenge_id":46,"content":"Have an eye on the HTTP traffic while placing products in the shopping basket. Changing the quantity of products already in the basket doesn't count.","cost":45},{"id":47,"type":"standard","challenge_id":47,"content":"You need to trick a security mechanism into thinking that the file you want has a valid file type.","cost":70},{"id":48,"type":"standard","challenge_id":48,"content":"Punctuality is the politeness of kings.","cost":135},{"id":49,"type":"standard","challenge_id":49,"content":"You might have to peel through several layers of tough-as-nails encryption for this challenge.","cost":70},{"id":50,"type":"standard","challenge_id":50,"content":"This challenge is essentially a stripped-down Denial of Service (DoS) attack.","cost":70},{"id":51,"type":"standard","challenge_id":51,"content":"Take a close look on how the $where query operator works in MongoDB.","cost":100},{"id":52,"type":"standard","challenge_id":52,"content":"Take a close look on how the equivalent of UPDATE-statements in MongoDB work.","cost":70},{"id":53,"type":"standard","challenge_id":53,"content":"We might have failed to take this out of our code properly.","cost":10},{"id":54,"type":"standard","challenge_id":54,"content":"This one should be equally easy to a) brute force, b) crack the password hash or c) simply guess.","cost":25},{"id":55,"type":"standard","challenge_id":55,"content":"You literally need to make the shop owe you any amount of money.","cost":45},{"id":56,"type":"standard","challenge_id":56,"content":"You do not have to pay anything to unlock this challenge! Nonetheless, donations are very much appreciated.","cost":135},{"id":57,"type":"standard","challenge_id":57,"content":"We won't even ask you to confirm that you did. Just read it. Please. Pretty please.","cost":10},{"id":58,"type":"standard","challenge_id":58,"content":"Only by visiting a special URL you can confirm that you read it carefully.","cost":45},{"id":59,"type":"standard","challenge_id":59,"content":"Look for one of the following: a) broken admin functionality, b) holes in RESTful API or c) possibility for SQL Injection.","cost":45},{"id":60,"type":"standard","challenge_id":60,"content":"Look for a url parameter where its value appears in the page it is leading to.","cost":25},{"id":61,"type":"standard","challenge_id":61,"content":"You can solve this by cleverly interacting with the UI or bypassing it altogether.","cost":10},{"id":62,"type":"standard","challenge_id":62,"content":"Not as trivial as Jim's but still not too difficult with some \"Futurama\" background knowledge.","cost":70},{"id":63,"type":"standard","challenge_id":63,"content":"Nothing a little bit of Facebook stalking couldn't reveal. Might involve a historical twist.","cost":100},{"id":64,"type":"standard","challenge_id":64,"content":"It's hard for celebrities to pick a security question from a hard-coded list where the answer is not publicly exposed.","cost":45},{"id":65,"type":"standard","challenge_id":65,"content":"Find a way to bypass the rate limiting and brute force the obfuscated answer to Morty's security question.","cost":100},{"id":66,"type":"standard","challenge_id":66,"content":"The product you might want to give a closer look is the OWASP Juice Shop Logo (3D-printed).","cost":100},{"id":67,"type":"standard","challenge_id":67,"content":"Reverse engineering something bad can make good things happen.","cost":135},{"id":68,"type":"standard","challenge_id":68,"content":"\"SSTi\" is a clear indicator that this has nothing to do with anything Angular. Also, make sure to use only our non-malicious malware.","cost":135},{"id":69,"type":"standard","challenge_id":69,"content":"Try to find a reference or clue behind the scenes. Or simply guess what URL the Score Board might have.","cost":10},{"id":70,"type":"standard","challenge_id":70,"content":"Undoubtably you want to read our security policy before conducting any research on our application.","cost":25},{"id":71,"type":"standard","challenge_id":71,"content":"The \"Comment\" field in the \"Customer Feedback\" screen is where you want to put your focus on.","cost":70},{"id":72,"type":"standard","challenge_id":72,"content":"No matter how good your eyes are, you will need tool assistance for this challenge.","cost":70},{"id":73,"type":"standard","challenge_id":73,"content":"Your attack payload must not trigger the protection against too many iterations.","cost":135},{"id":74,"type":"standard","challenge_id":74,"content":"This vulnerability will not affect any customer of the shop. It is aimed exclusively at its developers.","cost":100},{"id":75,"type":"standard","challenge_id":75,"content":"The 2FA implementation requires to store a secret for every user. You will need to find a way to access this secret in order to solve this challenge.","cost":100},{"id":76,"type":"standard","challenge_id":76,"content":"This challenge exploits a weird option that is supported when signing tokens with JWT.","cost":100},{"id":77,"type":"standard","challenge_id":77,"content":"You can attach a small file to the \"Complaint\" form. Investigate how this upload actually works.","cost":45},{"id":78,"type":"standard","challenge_id":78,"content":"You can attach a PDF or ZIP file to the \"Complaint\" form. Investigate how this upload actually works.","cost":45},{"id":79,"type":"standard","challenge_id":79,"content":"Gather information on where user data is stored and how it is addressed. Then craft a corresponding UNION SELECT attack.","cost":70},{"id":80,"type":"standard","challenge_id":80,"content":"You have to reuse the vulnerability behind one other 6-star challenge to be able to solve this one.","cost":135},{"id":81,"type":"standard","challenge_id":81,"content":"Have an eye on the HTTP traffic while shopping. Alternatively try to find a client-side association of users to their basket.","cost":25},{"id":82,"type":"standard","challenge_id":82,"content":"Report one of two possible answers via the \"Customer Feedback\" form. Do not forget to submit the library's version as well.","cost":70},{"id":83,"type":"standard","challenge_id":83,"content":"Report one of four possible answers via the \"Customer Feedback\" form.","cost":25},{"id":84,"type":"standard","challenge_id":84,"content":"You have to find a way to beat the allowlist of allowed redirect URLs.","cost":70},{"id":85,"type":"standard","challenge_id":85,"content":"The leverage point for this challenge is the deprecated B2B interface.","cost":45},{"id":86,"type":"standard","challenge_id":86,"content":"It is not as easy as sending a large amount of data directly to the deprecated B2B interface.","cost":100},{"id":87,"type":"standard","challenge_id":87,"content":"Before you invest time bypassing the API, you might want to play around with the UI a bit.","cost":10},{"id":88,"type":"standard","challenge_id":88,"content":"Check the Photo Wall for an image that could not be loaded correctly.","cost":10},{"id":89,"type":"standard","challenge_id":89,"content":"This challenge would formally have to be in several categories as the developers made multiple gaffes for this to be possible.","cost":100},{"id":90,"type":"standard","challenge_id":90,"content":"Try to guess what URL the endpoint might have.","cost":10},{"id":91,"type":"standard","challenge_id":91,"content":"Look closely at what happens when you attempt to upgrade your account.","cost":45},{"id":92,"type":"standard","challenge_id":92,"content":"Find a form which updates the username and then construct a malicious page in the online HTML editor.","cost":45},{"id":93,"type":"standard","challenge_id":93,"content":"Copy + Paste = Solved!","cost":10},{"id":94,"type":"standard","challenge_id":94,"content":"You might have to do some OSINT on his social media personas to find out his honest answer to the security question.","cost":70},{"id":95,"type":"standard","challenge_id":95,"content":"Take a look at the meta data of the corresponding photo.","cost":25},{"id":96,"type":"standard","challenge_id":96,"content":"Take a look at the details in the photo to determine the location of where it was taken.","cost":25},{"id":97,"type":"standard","challenge_id":97,"content":"Think of a way to get a hold of the internal workings on the chatbot API.","cost":100},{"id":98,"type":"standard","challenge_id":98,"content":"Take a look at the details in the photo to determine the location of where it was taken.","cost":70},{"id":99,"type":"standard","challenge_id":99,"content":"Just keep asking.","cost":10},{"id":100,"type":"standard","challenge_id":100,"content":"You should read up on vulnerabilities in popular NodeJs template engines.","cost":100}]}